COMPARISION OF 3 NO'S


ID DIVISION.
PROGRAM ID. THREENUM.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 A PIC 99.
01 B PIC 99.
01 C PIC 99.
PROCEDURE DIVISION.
    ACCEPT A.
    ACCEPT B.
    ACCEPT C.
    IF ((A = B) AND (B = C))
      DISPLAY 'ALL ARE EQUAL'
    END-IF
    IF (A > C)
      IF(A > B)
         DISPLAY 'A IS BIGGER'
      END-IF
    END-IF
    IF (B > A)
      IF(B > C)
         DISPLAY 'B IS BIGGER'
      END-IF
    END-IF 
    IF (C > A)
      IF (C > B)
         DISPLAY ' C IS BIGGER'
      END-IF
    END-IF
    IF (A > B) 
       IF (B > C)
         DISPLAY 'A AND B ARE BIGGER'
       END-IF
    END-IF
    IF ( A > B)
      IF ( C > B)
         DISPLAY 'A AND C ARE BIGGER'
      END-IF
    END-IF
    IF ( B > A)
      IF ( C > A)
          DISPLAY 'B AND C ARE BIGGER'
      END-IF
    END-IF
    STOP RUN.


ID DIVSION.
PROGRAM-ID. DAY.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-DAY PIC X(3).
   05 WS-MON VALUE 'MON'.
   05 WS-TUE VALUE 'TUE'.
   05 WS-WED VALUE 'WED'.
   05 WS-THR VALUE 'THR'.
   05 WS-FRI VALUE 'FRI'.
   05 WS-SAT VALUE 'SAT'.
   05 WS-SUN VALUE 'SUN'.
PROCEDURE DIVISION.
MAIN-PROGRAM
       ACCEPT WS-DAY.
       EVALUATE TRUE
       WHEN WS-MON OR WS-TUE OR WS-WED OR WS-THR OR WS-FRI
       DISPLAY 'WORKING DAY'
       WHEN WS-SAT OR WS-SUN
          DISPLAY 'HOLIDAY'
       WHEN OTHER
          DISPLAY 'WRONG INPUT'
       END-EVALUATE.
       STOP -RUN.
     